; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image3 - mode
	thermograph1 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation10 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation14 - direction
	GroundStation15 - direction
	Star16 - direction
	Star17 - direction
	GroundStation19 - direction
	Star1 - direction
	GroundStation18 - direction
	Star8 - direction
	Star11 - direction
	Star9 - direction
	Star20 - direction
	Star21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Star24 - direction
	Phenomenon25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Phenomenon31 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation18)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 image3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation18)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation14)
)
(:goal (and
	(have_image Star20 thermograph1)
	(have_image Star21 image3)
	(have_image Planet22 image3)
	(have_image Phenomenon23 thermograph1)
	(have_image Star24 image3)
	(have_image Phenomenon25 image3)
	(have_image Phenomenon26 thermograph2)
	(have_image Star27 image3)
	(have_image Star28 thermograph2)
	(have_image Phenomenon29 thermograph2)
	(have_image Planet30 thermograph2)
	(have_image Phenomenon31 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (turn_to satellite1 phenomenon23 groundstation14)
   deleted: (pointing satellite1 groundstation14)
   added: (pointing satellite1 phenomenon23)
   goals met: 0 of 12
4. (turn_to satellite0 groundstation18 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation18)
   goals met: 0 of 12
5. (calibrate satellite0 instrument0 groundstation18)
   added: (calibrated instrument0)
   goals met: 0 of 12
6. (turn_to satellite0 phenomenon25 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon25)
   goals met: 0 of 12
7. (take_image satellite0 phenomenon25 instrument0 image3)
   added: (have_image phenomenon25 image3)
   goals met: 1 of 12
8. (turn_to satellite0 phenomenon26 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon26)
   goals met: 1 of 12
9. (take_image satellite0 phenomenon26 instrument0 thermograph2)
   added: (have_image phenomenon26 thermograph2)
   goals met: 2 of 12
10. (turn_to satellite0 phenomenon29 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 phenomenon29)
   goals met: 2 of 12
11. (take_image satellite0 phenomenon29 instrument0 thermograph2)
   added: (have_image phenomenon29 thermograph2)
   goals met: 3 of 12
12. (turn_to satellite0 planet22 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 planet22)
   goals met: 3 of 12
13. (take_image satellite0 planet22 instrument0 image3)
   added: (have_image planet22 image3)
   goals met: 4 of 12
14. (turn_to satellite0 planet30 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 planet30)
   goals met: 4 of 12
15. (take_image satellite0 planet30 instrument0 thermograph2)
   added: (have_image planet30 thermograph2)
   goals met: 5 of 12
16. (turn_to satellite0 star21 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 star21)
   goals met: 5 of 12
17. (take_image satellite0 star21 instrument0 image3)
   added: (have_image star21 image3)
   goals met: 6 of 12
18. (turn_to satellite0 star24 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star24)
   goals met: 6 of 12
19. (take_image satellite0 star24 instrument0 image3)
   added: (have_image star24 image3)
   goals met: 7 of 12
20. (turn_to satellite0 star27 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 star27)
   goals met: 7 of 12
21. (take_image satellite0 star27 instrument0 image3)
   added: (have_image star27 image3)
   goals met: 8 of 12
22. (turn_to satellite0 star28 star27)
   deleted: (pointing satellite0 star27)
   added: (pointing satellite0 star28)
   goals met: 8 of 12
23. (take_image satellite0 star28 instrument0 thermograph2)
   added: (have_image star28 thermograph2)
   goals met: 9 of 12
24. (turn_to satellite1 star1 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 star1)
   goals met: 9 of 12
25. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 9 of 12
26. (turn_to satellite1 phenomenon23 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon23)
   goals met: 9 of 12
27. (take_image satellite1 phenomenon23 instrument1 thermograph1)
   added: (have_image phenomenon23 thermograph1)
   goals met: 10 of 12
28. (turn_to satellite1 phenomenon31 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon31)
   goals met: 10 of 12
29. (take_image satellite1 phenomenon31 instrument1 thermograph1)
   added: (have_image phenomenon31 thermograph1)
   goals met: 11 of 12
30. (turn_to satellite1 star20 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 star20)
   goals met: 11 of 12
31. (take_image satellite1 star20 instrument1 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 12 of 12
